In [1]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

data = pd.read_csv('./PatientInfo.csv') ## 코로나 시각화 대회의 확진자 정보 데이터 가져오기

In [2]:
data.head()

,patient_id,global_num,sex,birth_year,age,country,province,city,disease,infection_case,infection_order,infected_by,contact_number,symptom_onset_date,confirmed_date,released_date,deceased_date,state
0,1000000001,2.0,male,1964,50s,Korea,Seoul,Gangseo-gu,NaN,overseas inflow,1.0,NaN,75,2020-01-22,2020-01-23,2020-02-05,NaN,released
1,1000000002,5.0,male,1987,30s,Korea,Seoul,Jungnang-gu,NaN,overseas inflow,1.0,NaN,31,NaN,2020-01-30,2020-03-02,NaN,released
2,1000000003,6.0,male,1964,50s,Korea,Seoul,Jongno-gu,NaN,contact with patient,2.0,2002000001,17,NaN,2020-01-30,2020-02-19,NaN,released
3,1000000004,7.0,male,1991,20s,Korea,Seoul,Mapo-gu,NaN,overseas inflow,1.0,NaN,9,2020-01-26,2020-01-30,2020-02-15,NaN,released
4,1000000005,9.0,female,1992,20s,Korea,Seoul,Seongbuk-gu,NaN,contact with patient,2.0,1000000002,2,NaN,2020-01-31,2020-02-24,NaN,released

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4004 entries, 0 to 4003
Data columns (total 18 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   patient_id          4004 non-null   int64
 1   global_num          2806 non-null   float64
 2   sex                 3674 non-null   object
 3   birth_year          3267 non-null   object
 4   age                 3525 non-null   object
 5   country             4004 non-null   object
 6   province            4004 non-null   object
 7   city                3926 non-null   object
 8   disease             18 non-null     object
 9   infection_case      3211 non-null   object
 10  infection_order     31 non-null     float64
 11  infected_by         899 non-null    object
 12  contact_number      680 non-null    object
 13  symptom_onset_date  535 non-null    object
 14  confirmed_date      4001 non-null   object
 15  released_date       1508 non-null   object
 16  deceased_date       65 non-null     object
 17  state               4004 non-null   object
dtypes: float64(2), int64(1), object(15)
memory usage: 563.2+ KB

In [4]:
set(data['province']) ## 확진자의 지역, 우리가 진행중인 데이터의 sido와 동일하다

{'Busan',
 'Chungcheongbuk-do',
 'Chungcheongnam-do',
 'Daegu',
 'Daejeon',
 'Gangwon-do',
 'Gwangju',
 'Gyeonggi-do',
 'Gyeongsangbuk-do',
 'Gyeongsangnam-do',
 'Incheon',
 'Jeju-do',
 'Jeollabuk-do',
 'Jeollanam-do',
 'Sejong',
 'Seoul',
 'Ulsan'}

In [5]:
set(data['age']) ## 0~100, 10s~70s만 사용할 것

{'0s',
 '100s',
 '10s',
 '20s',
 '30',
 '30s',
 '40s',
 '50s',
 '60s',
 '70s',
 '80s',
 '90s',
 nan}

In [6]:
set(data['country']) ## 국내외 포함하여 확진자 카운트할 것

{'Bangladesh',
 'Canada',
 'China',
 'Foreign',
 'France',
 'Germany',
 'Indonesia',
 'Korea',
 'Mongolia',
 'Spain',
 'Switzerland',
 'Thailand',
 'United Kingdom',
 'United States',
 'Vietnam'}

In [7]:
df= data[['sex', 'age', 'province', 'confirmed_date']] ## 성별, 나이, 지역, 확진 날짜

In [8]:
df.head()

      sex  age province confirmed_date
0    male  50s    Seoul     2020-01-23
1    male  30s    Seoul     2020-01-30
2    male  50s    Seoul     2020-01-30
3    male  20s    Seoul     2020-01-30
4  female  20s    Seoul     2020-01-31

In [9]:
df.info() ## 널값이 있다(아래에서 삭제할 것)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4004 entries, 0 to 4003
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sex             3674 non-null   object
 1   age             3525 non-null   object
 2   province        4004 non-null   object
 3   confirmed_date  4001 non-null   object
dtypes: object(4)
memory usage: 125.2+ KB

In [10]:
import re ## 우리가 분석 중인 데이터와 날짜를 맞추기 위해 변경 

def grap_year_month(data):
    data = str(data)
    data = re.sub('-', '', data)
    return str(data[:6])

In [11]:
df['confirmed_date'] = df['confirmed_date'].apply(lambda x : grap_year_month(x))

In [12]:
def grap_sex(data):  ## male, female -> 1,2
    data = str(data)
    if data == 'female' :
        return 2
    else :
        return 1

In [13]:
df['sex'] = df['sex'].apply(lambda x : grap_sex(x))

In [14]:
def province_korean(data) : ## 지역명을 영문에서 한글로 변경
    data = str(data)
    if data =='Busan':
        return "부산"
    elif data =='Chungcheongbuk-do' :
        return "충북"
    elif data =='Chungcheongnam-do' :
        return "충남"
    elif data =='Daegu' :
        return "대구"
    elif data =='Daejeon' :
        return "대전"
    elif data =='Gangwon-do' :
        return "강원"
    elif data =='Gyeonggi-do' :
        return "경기"
    elif data =='Gwangju' :
        return "광주"
    elif data =='Gyeongsangbuk-do' :
        return "경북"
    elif data =='Gyeongsangnam-do' :
        return "경남"
    elif data =='Incheon' :
        return "인천"
    elif data =='Jeju-do' :
        return "제주"
    elif data =='Jeollabuk-do' :
        return "전북"
    elif data =='Jeollanam-do' :
        return "전남"
    elif data =='Sejong' :
        return "세종"
    elif data =='Seoul' :
        return "서울"
    elif data =='Ulsan' :
        return "울산"

In [15]:
df['province'] = df['province'].apply(lambda x : province_korean(x))

In [16]:
df.head()

   sex  age province confirmed_date
0    1  50s       서울         202001
1    1  30s       서울         202001
2    1  50s       서울         202001
3    1  20s       서울         202001
4    2  20s       서울         202001

In [17]:
df['count'] = 1 ## 개인 확진자의 정보이기때문에 count피처에 1대입

In [18]:
df = df.dropna(axis = 0, how = 'any') ## 널값 포함하는 행 삭제

In [19]:
df.head()

   sex  age province confirmed_date  count
0    1  50s       서울         202001      1
1    1  30s       서울         202001      1
2    1  50s       서울         202001      1
3    1  20s       서울         202001      1
4    2  20s       서울         202001      1

In [20]:
df.columns = ['SEX_CTGO_CD', 'AGE', 'CARD_SIDO_NM', 'REG_YYMM', 'confirmed case'] ## 분석중인 데이터와 컬럼명 동일하게

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3525 entries, 0 to 4003
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   SEX_CTGO_CD     3525 non-null   int64
 1   AGE             3525 non-null   object
 2   CARD_SIDO_NM    3525 non-null   object
 3   REG_YYMM        3525 non-null   object
 4   confirmed case  3525 non-null   int64
dtypes: int64(2), object(3)
memory usage: 165.2+ KB

In [22]:
set(df['SEX_CTGO_CD'])

{1, 2}

In [23]:
set(df['AGE'])

{'0s',
 '100s',
 '10s',
 '20s',
 '30',
 '30s',
 '40s',
 '50s',
 '60s',
 '70s',
 '80s',
 '90s'}

In [24]:
set(df['CARD_SIDO_NM'])

{'강원',
 '경기',
 '경남',
 '경북',
 '광주',
 '대구',
 '대전',
 '부산',
 '서울',
 '세종',
 '울산',
 '인천',
 '전남',
 '전북',
 '제주',
 '충남',
 '충북'}

In [25]:
set(df['REG_YYMM']) ## 4월 5월 nan 삭제

{'202001', '202002', '202003', '202004', '202005', 'nan'}

In [26]:
df_drop = df[df['REG_YYMM']=='nan'].index
df_drop1 = df[df['REG_YYMM']=='202004'].index
df_drop2 = df[df['REG_YYMM']=='202005'].index
df = df.drop(df_drop)
df = df.drop(df_drop1)
df = df.drop(df_drop2)

In [27]:
set(df['REG_YYMM'])

{'202001', '202002', '202003'}

In [28]:
df_drop = df[df['AGE']=='0s'].index ## 10s~70s 제외 삭제
df_drop1 = df[df['AGE']=='100s'].index
df_drop2 = df[df['AGE']=='90s'].index
df_drop3 = df[df['AGE']=='80s'].index
df = df.drop(df_drop)
df = df.drop(df_drop1)
df = df.drop(df_drop2)
df = df.drop(df_drop3)

In [29]:
set(df['AGE'])

{'10s', '20s', '30s', '40s', '50s', '60s', '70s'}

In [30]:
df_group = df.groupby(['SEX_CTGO_CD', 'AGE', 'CARD_SIDO_NM', 'REG_YYMM']).sum() ## 성별, 나이, 지역, 확진 달로 그룹화하여 sum

In [31]:
df_group.head(10)

                                       confirmed case
SEX_CTGO_CD AGE CARD_SIDO_NM REG_YYMM
1           10s 경기           202003                12
                경남           202002                 2
                경북           202002                 5
                             202003                17
                대전           202003                 1
                부산           202002                 4
                             202003                 4
                서울           202002                 1
                             202003                 9
                세종           202003                 1

In [32]:
len(df_group) ## 경우의 수를 따지면 714행이여야하는데 정보가 모든 경우의 수를 만족하지 않는다

314

In [33]:
df_group.to_csv('df_group.csv', encoding='utf-8-sig') ## 위의 그룹데이터를 우선 저장

In [34]:
df = pd.read_csv('./df_group.csv') ## 다시 불러온다

In [35]:
df.head() ## 아래처럼 보기위해 다시 불러온 것

   SEX_CTGO_CD  AGE CARD_SIDO_NM  REG_YYMM  confirmed case
0            1  10s           경기    202003              12
1            1  10s           경남    202002               2
2            1  10s           경북    202002               5
3            1  10s           경북    202003              17
4            1  10s           대전    202003               1

In [36]:
df['confirmed case'].describe()

count    314.000000
mean       8.401274
std       14.379769
min        1.000000
25%        1.000000
50%        3.000000
75%        7.000000
max       96.000000
Name: confirmed case, dtype: float64

In [37]:
df = df.rename({'confirmed case': 'confirmed_case'}, axis = 'columns')

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 314 entries, 0 to 313
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   SEX_CTGO_CD     314 non-null    int64
 1   AGE             314 non-null    object
 2   CARD_SIDO_NM    314 non-null    object
 3   REG_YYMM        314 non-null    int64
 4   confirmed_case  314 non-null    int64
dtypes: int64(3), object(2)
memory usage: 12.4+ KB

In [39]:
int_features = ['confirmed_case']

for i in enumerate(int_features) :
    ca = i[1]
    df[ca] = df[ca].astype('int')

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 314 entries, 0 to 313
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   SEX_CTGO_CD     314 non-null    int64
 1   AGE             314 non-null    object
 2   CARD_SIDO_NM    314 non-null    object
 3   REG_YYMM        314 non-null    int64
 4   confirmed_case  314 non-null    int32
dtypes: int32(1), int64(2), object(2)
memory usage: 11.2+ KB

In [41]:
df['SEX_CTGO_CD'].unique()

array([1, 2], dtype=int64)

In [42]:
df['AGE'].unique()

array(['10s', '20s', '30s', '40s', '50s', '60s', '70s'], dtype=object)

In [43]:
df['CARD_SIDO_NM'].unique()

array(['경기', '경남', '경북', '대전', '부산', '서울', '세종', '울산', '충남', '충북', '강원',
       '광주', '대구', '인천', '전남', '전북', '제주'], dtype=object)

In [44]:
df['REG_YYMM'].unique()

array([202003, 202002, 202001], dtype=int64)

In [45]:
import numpy as np 

## 모든 경우의 수로 714행의 가상 table 생성(count는 없다)

sexs = df['SEX_CTGO_CD'].unique()
ages  = df['AGE'].unique()
sidos  = df['CARD_SIDO_NM'].unique()
dates  = df['REG_YYMM'].unique()

table = []
for sex in sexs:
    for age in ages:
        for sido in sidos:
            for date in dates:
                table.append([sex, age, sido, date])
                
table = np.array(table)
table = pd.DataFrame(data=table, columns=['SEX_CTGO_CD', 'AGE', 'CARD_SIDO_NM', 'REG_YYMM'])

In [46]:
table.head()

  SEX_CTGO_CD  AGE CARD_SIDO_NM REG_YYMM
0           1  10s           경기   202003
1           1  10s           경기   202002
2           1  10s           경기   202001
3           1  10s           경남   202003
4           1  10s           경남   202002

In [47]:
len(table) ## 714개 만족

714

In [48]:
table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 714 entries, 0 to 713
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   SEX_CTGO_CD   714 non-null    object
 1   AGE           714 non-null    object
 2   CARD_SIDO_NM  714 non-null    object
 3   REG_YYMM      714 non-null    object
dtypes: object(4)
memory usage: 22.4+ KB

In [49]:
int_features = ['SEX_CTGO_CD', 'REG_YYMM'] ## 병합하기 위해 두 데이터프레임의 타입을 맞춤

for i in enumerate(int_features) :
    ca = i[1]
    table[ca] = table[ca].astype('int')

In [50]:
table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 714 entries, 0 to 713
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   SEX_CTGO_CD   714 non-null    int32
 1   AGE           714 non-null    object
 2   CARD_SIDO_NM  714 non-null    object
 3   REG_YYMM      714 non-null    int32
dtypes: int32(2), object(2)
memory usage: 16.9+ KB

In [51]:
data = pd.merge(df, table, on = ['SEX_CTGO_CD', 'AGE', 'CARD_SIDO_NM', 'REG_YYMM'], how = 'outer') ## 병합

In [52]:
data.head()

   SEX_CTGO_CD  AGE CARD_SIDO_NM  REG_YYMM  confirmed_case
0            1  10s           경기    202003            12.0
1            1  10s           경남    202002             2.0
2            1  10s           경북    202002             5.0
3            1  10s           경북    202003            17.0
4            1  10s           대전    202003             1.0

In [53]:
data['SEX_CTGO_CD'].unique()

array([1, 2], dtype=int64)

In [54]:
set(data['AGE'])

{'10s', '20s', '30s', '40s', '50s', '60s', '70s'}

In [55]:
data['CARD_SIDO_NM'].unique()

array(['경기', '경남', '경북', '대전', '부산', '서울', '세종', '울산', '충남', '충북', '강원',
       '광주', '대구', '인천', '전남', '전북', '제주'], dtype=object)

In [56]:
data['REG_YYMM'].unique()

array([202003, 202002, 202001], dtype=int64)

In [57]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 713
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   SEX_CTGO_CD     714 non-null    int64
 1   AGE             714 non-null    object
 2   CARD_SIDO_NM    714 non-null    object
 3   REG_YYMM        714 non-null    int64
 4   confirmed_case  314 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 33.5+ KB

In [58]:
len(data)  ## 2*7*17*3=714 만족, 대신 없는 경우의 수는 NaN으로 표현됨

714

In [59]:
data.isnull().sum() ## null 값은 확진자가 없는 경우의 수이므로 0으로 값 치환

SEX_CTGO_CD         0
AGE                 0
CARD_SIDO_NM        0
REG_YYMM            0
confirmed_case    400
dtype: int64

In [60]:
data = data.fillna(int(0))

In [61]:
data.isnull().sum() ## 널값 사라짐

SEX_CTGO_CD       0
AGE               0
CARD_SIDO_NM      0
REG_YYMM          0
confirmed_case    0
dtype: int64

In [62]:
int_features = ['confirmed_case'] ## 병합하기 위해 두 데이터프레임의 타입을 맞춤

for i in enumerate(int_features) :
    ca = i[1]
    data[ca] = data[ca].astype('int')

In [63]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 713
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   SEX_CTGO_CD     714 non-null    int64
 1   AGE             714 non-null    object
 2   CARD_SIDO_NM    714 non-null    object
 3   REG_YYMM        714 non-null    int64
 4   confirmed_case  714 non-null    int32
dtypes: int32(1), int64(2), object(2)
memory usage: 30.7+ KB

In [64]:
data.head() ## 모든 경우의 수에 대한 각 피처별 확진자 수

   SEX_CTGO_CD  AGE CARD_SIDO_NM  REG_YYMM  confirmed_case
0            1  10s           경기    202003              12
1            1  10s           경남    202002               2
2            1  10s           경북    202002               5
3            1  10s           경북    202003              17
4            1  10s           대전    202003               1

In [65]:
## 추가 피처 : 2개월 누적 확진자, 3개월 누적 확진자

In [66]:
def jan_accum(date, count) :
    if date == 202001 :
        return int(count)

data['jan_accum'] = data.apply(lambda x: jan_accum(x.REG_YYMM, x.confirmed_case), axis = 1)

In [67]:
data.head()

   SEX_CTGO_CD  AGE CARD_SIDO_NM  REG_YYMM  confirmed_case  jan_accum
0            1  10s           경기    202003              12        NaN
1            1  10s           경남    202002               2        NaN
2            1  10s           경북    202002               5        NaN
3            1  10s           경북    202003              17        NaN
4            1  10s           대전    202003               1        NaN

In [68]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 713
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   SEX_CTGO_CD     714 non-null    int64
 1   AGE             714 non-null    object
 2   CARD_SIDO_NM    714 non-null    object
 3   REG_YYMM        714 non-null    int64
 4   confirmed_case  714 non-null    int32
 5   jan_accum       238 non-null    float64
dtypes: float64(1), int32(1), int64(2), object(2)
memory usage: 36.3+ KB

In [69]:
data = data.fillna(int(0))

In [70]:
data.head()

   SEX_CTGO_CD  AGE CARD_SIDO_NM  REG_YYMM  confirmed_case  jan_accum
0            1  10s           경기    202003              12        0.0
1            1  10s           경남    202002               2        0.0
2            1  10s           경북    202002               5        0.0
3            1  10s           경북    202003              17        0.0
4            1  10s           대전    202003               1        0.0

In [71]:
set(data['jan_accum'])

{0.0, 1.0, 2.0}

In [72]:
data = data.astype({'jan_accum' : 'int'})

In [73]:
def feb_accum(sex,age,sido,date,feb_count ) :

    if date == 202002 :
        accum = data.loc[(data["SEX_CTGO_CD"]==sex) & (data["AGE"]==age ) & (data['CARD_SIDO_NM'] ==sido)& (data['REG_YYMM'] == 202001), "jan_accum"]
        return int(accum) + int(feb_count)

data['feb_accum'] = data.apply(lambda x: feb_accum(x.SEX_CTGO_CD, x.AGE, x.CARD_SIDO_NM, x.REG_YYMM, x.confirmed_case), axis = 1)

In [74]:
data.head()

,SEX_CTGO_CD,AGE,CARD_SIDO_NM,REG_YYMM,confirmed_case,jan_accum,feb_accum
0,1,10s,경기,202003,12,0,NaN
1,1,10s,경남,202002,2,0,2.0
2,1,10s,경북,202002,5,0,5.0
3,1,10s,경북,202003,17,0,NaN
4,1,10s,대전,202003,1,0,NaN

In [75]:
data = data.fillna(int(0))

In [76]:
data = data.astype({'feb_accum' : 'int'})

In [77]:
data.head()

,SEX_CTGO_CD,AGE,CARD_SIDO_NM,REG_YYMM,confirmed_case,jan_accum,feb_accum
0,1,10s,경기,202003,12,0,0
1,1,10s,경남,202002,2,0,2
2,1,10s,경북,202002,5,0,5
3,1,10s,경북,202003,17,0,0
4,1,10s,대전,202003,1,0,0

In [78]:
def mar_accum(sex,age,sido,date,mar_count ) :

    if date == 202003 :
        accum = data.loc[(data["SEX_CTGO_CD"]==sex) & (data["AGE"]==age ) & (data['CARD_SIDO_NM'] ==sido)& (data['REG_YYMM'] == 202002), "feb_accum"]
        return int(accum) + int(mar_count)

data['mar_accum'] = data.apply(lambda x: mar_accum(x.SEX_CTGO_CD, x.AGE, x.CARD_SIDO_NM, x.REG_YYMM, x.confirmed_case), axis = 1)

In [79]:
data.head()

,SEX_CTGO_CD,AGE,CARD_SIDO_NM,REG_YYMM,confirmed_case,jan_accum,feb_accum,mar_accum
0,1,10s,경기,202003,12,0,0,12.0
1,1,10s,경남,202002,2,0,2,NaN
2,1,10s,경북,202002,5,0,5,NaN
3,1,10s,경북,202003,17,0,0,22.0
4,1,10s,대전,202003,1,0,0,1.0

In [80]:
data = data.fillna(int(0))

In [81]:
data.head()

,SEX_CTGO_CD,AGE,CARD_SIDO_NM,REG_YYMM,confirmed_case,jan_accum,feb_accum,mar_accum
0,1,10s,경기,202003,12,0,0,12.0
1,1,10s,경남,202002,2,0,2,0.0
2,1,10s,경북,202002,5,0,5,0.0
3,1,10s,경북,202003,17,0,0,22.0
4,1,10s,대전,202003,1,0,0,1.0

In [82]:
data = data.astype({'mar_accum' : 'int'})

In [83]:
data.head()

,SEX_CTGO_CD,AGE,CARD_SIDO_NM,REG_YYMM,confirmed_case,jan_accum,feb_accum,mar_accum
0,1,10s,경기,202003,12,0,0,12
1,1,10s,경남,202002,2,0,2,0
2,1,10s,경북,202002,5,0,5,0
3,1,10s,경북,202003,17,0,0,22
4,1,10s,대전,202003,1,0,0,1

In [84]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 713
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   SEX_CTGO_CD     714 non-null    int64
 1   AGE             714 non-null    object
 2   CARD_SIDO_NM    714 non-null    object
 3   REG_YYMM        714 non-null    int64
 4   confirmed_case  714 non-null    int32
 5   jan_accum       714 non-null    int32
 6   feb_accum       714 non-null    int32
 7   mar_accum       714 non-null    int32
dtypes: int32(4), int64(2), object(2)
memory usage: 39.0+ KB

In [85]:
def accum(jan, feb, mar) :
    accum = jan + feb + mar
    return accum
    
data['accum'] = data.apply(lambda x: accum(x.jan_accum, x.feb_accum, x.mar_accum), axis = 1)
data = data.drop(['jan_accum', 'feb_accum', 'mar_accum'], axis=1)

In [86]:
data.head()

   SEX_CTGO_CD  AGE CARD_SIDO_NM  REG_YYMM  confirmed_case  accum
0            1  10s           경기    202003              12     12
1            1  10s           경남    202002               2      2
2            1  10s           경북    202002               5      5
3            1  10s           경북    202003              17     22
4            1  10s           대전    202003               1      1

In [87]:
data.to_csv('accumulate.csv', encoding='utf-8-sig', index= False) ## 위의 그룹데이터를 우선 저장

In [88]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 714 entries, 0 to 713
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   SEX_CTGO_CD     714 non-null    int64
 1   AGE             714 non-null    object
 2   CARD_SIDO_NM    714 non-null    object
 3   REG_YYMM        714 non-null    int64
 4   confirmed_case  714 non-null    int32
 5   accum           714 non-null    int64
dtypes: int32(1), int64(3), object(2)
memory usage: 36.3+ KB